<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | ModelFilter 默认命名空间
    |--------------------------------------------------------------------------
    |
    | 定义 ModelFilter 类的默认命名空间。
    | 例如：User 模型的 Filter 类将默认为 App\ModelFilters\UserFilter
    |
    */
    'namespace' => 'App\\ModelFilters\\',

    /*
    |--------------------------------------------------------------------------
    | 默认分页限制
    |--------------------------------------------------------------------------
    |
    | 使用 paginateFilter() 时的默认每页记录数
    |
    */
    'paginate_limit' => 15,
];
